Req Res/QueryCustomer-sample-response.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXepABJ3ZWJsb2dpYy5hcHAuR1dFSkIAAADWAAAAI3dlYmxvZ2ljLndvcmthcmVhLlN0cmluZ1dvcmtDb250ZXh0AAsxMi4wLjMuNS4xMAAhd2VibG9naWMuYXBwLkZDVUJTQ3VzdG9tZXJTZXJ2aWNlAAAA1gAAACN3ZWJsb2dpYy53b3JrYXJlYS5TdHJpbmdXb3JrQ29udGV4dAALMTIuMC4zLjUuMTAAAA==</work:WorkContext>
   </S:Header>
   <S:Body>
      <QUERYCUSTOMER_IOFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSCustomerService">
         <FCUBS_HEADER>
            <SOURCE>FLEXCUBE</SOURCE>
            <UBSCOMP>FCUBS</UBSCOMP>
            <MSGID/>
            <CORRELID/>
            <USERID>ADCUSER</USERID>
            <BRANCH>001</BRANCH>
            <SERVICE>FCUBSCustomerService</SERVICE>
            <OPERATION>QueryCustomer</OPERATION>
            <SOURCE_OPERATION/>
            <DESTINATION>ADC</DESTINATION>
            <FUNCTIONID>STDCIF</FUNCTIONID>
            <ACTION>EXECUTEQUERY</ACTION>
            <MSGSTAT>SUCCESS</MSGSTAT>
            <ADDL/>
         </FCUBS_HEADER>
         <FCUBS_BODY>
            <Customer-Full>
               <PRIVATE_CUSTOMER>Y</PRIVATE_CUSTOMER>
               <CUSTNO>1111532</CUSTNO>
               <CTYPE>I</CTYPE>
               <NAME>ABENEZER DESTA ZELEKE</NAME>
               <ADDRLN1>AA</ADDRLN1>
               <ADDRLN3>W-02</ADDRLN3>
               <ADDRLN2>N/S/L</ADDRLN2>
               <COUNTRY>ET</COUNTRY>
               <SNAME>0011ABDEZE1</SNAME>
               <NLTY>ET</NLTY>
               <LBRN>001</LBRN>
               <CCATEG>COOP_ASSO</CCATEG>
               <FULLNAME>ABENEZER DESTA ZELEKE</FULLNAME>
               <CIFCREATIONDT>2019-11-21</CIFCREATIONDT>
               <ISELCMCUST>Y</ISELCMCUST>
               <ELCMCUSTNO>1111532</ELCMCUSTNO>
               <AR_AP_TRACKING>N</AR_AP_TRACKING>
               <EXPCNTRY>ET</EXPCNTRY>
               <FROZEN>N</FROZEN>
               <DEAD>N</DEAD>
               <WHRUNKN>N</WHRUNKN>
               <MEDIA>MAIL</MEDIA>
               <LOC>AA</LOC>
               <MAILRSREQD>N</MAILRSREQD>
               <CLSPARTICIPANT>N</CLSPARTICIPANT>
               <FXNETTCUST>1111532</FXNETTCUST>
               <CRMCUST>N</CRMCUST>
               <ISSUCUST>N</ISSUCUST>
               <TRSRYCUST>N</TRSRYCUST>
               <RELPRICING>N</RELPRICING>
               <MT920>N</MT920>
               <FLGJOINT>N</FLGJOINT>
               <CREATEACC>Y</CREATEACC>
               <CREATEDACCOUNT>0011111153213001</CREATEDACCOUNT>
               <TRACK_LIMITS>Y</TRACK_LIMITS>
               <LIABID>1111532</LIABID>
               <LMCCY>ETB</LMCCY>
               <FLGUTLTYPRVDR>N</FLGUTLTYPRVDR>
               <AMLREQD>N</AMLREQD>
               <CHKDIGITVALREQD>N</CHKDIGITVALREQD>
               <FTACCASOF>M</FTACCASOF>
               <CUSTUNADV>N</CUSTUNADV>
               <CONSTAXCERTRQD>N</CONSTAXCERTRQD>
               <INDTAXCERTRQD>N</INDTAXCERTRQD>
               <CLSCCYALLWD>D</CLSCCYALLWD>
               <AUTOGENSTMTPLAN>N</AUTOGENSTMTPLAN>
               <MFI_CUSTOMER>N</MFI_CUSTOMER>
               <INVESTCUST>N</INVESTCUST>
               <ALLOWVRTLACCNTS>N</ALLOWVRTLACCNTS>
               <SSTAFF>N</SSTAFF>
               <MAKER>ADESTA</MAKER>
               <MAKERSTAMP>2022-12-12 09:36:58</MAKERSTAMP>
               <CHECKER>ADESTA</CHECKER>
               <CHECKERSTAMP>2022-12-12 09:37:00</CHECKERSTAMP>
               <MODNO>14</MODNO>
               <TXNSTAT>O</TXNSTAT>
               <AUTHSTAT>A</AUTHSTAT>
               <Custpersonal>
                  <FSTNAME>KEBEDE</FSTNAME>
                  <MIDNAME>DESTA</MIDNAME>
                  <LSTNAME>ZELEKE</LSTNAME>
                  <DOB>1997-07-24</DOB>
                  <GENDR>M</GENDR>
                  <NATIONID>123412341234</NATIONID>
                  <MOBNUM>715033159++0977423120++0939966486</MOBNUM>
                  <CUST_COMM_MODE>M</CUST_COMM_MODE>
                  <LANG>ENG</LANG>
                  <SBMTAGEPROOF>N</SBMTAGEPROOF>
                  <MINOR>N</MINOR>
                  <KYCSTAT>N</KYCSTAT>
                  <SAME_CORR_ADDR>N</SAME_CORR_ADDR>
                  <SAME_PERM_ADDR>Y</SAME_PERM_ADDR>
                  <BIRTHCOUNTRY>ET</BIRTHCOUNTRY>
                  <USRESSTATUS>N</USRESSTATUS>
                  <PAISSUED>N</PAISSUED>
                  <VSTUSPREV>N</VSTUSPREV>
                  <PREF_CNTACT_TIME>0</PREF_CNTACT_TIME>
                  <Custdomestic>
                     <CUSTNO>1111532</CUSTNO>
                  </Custdomestic>
                  <Custprof>
                     <CUSTNO>1111532</CUSTNO>
                     <EMPSTAT>F</EMPSTAT>
                  </Custprof>
               </Custpersonal>
               <Custcorp/>
               <Doctype-Remarks>
                  <CUSTOMER_NO>1111532</CUSTOMER_NO>
               </Doctype-Remarks>
               <Custsegment/>
               <Ofsll-Params>
                  <STOP_CORESPONDENCE_FLAG>N</STOP_CORESPONDENCE_FLAG>
                  <DISABILITY_INDICATR>N</DISABILITY_INDICATR>
                  <PRVCY_OPT_OUT_INDCTR>Y</PRVCY_OPT_OUT_INDCTR>
                  <BANKRUPTCY_INDCTR>N</BANKRUPTCY_INDCTR>
               </Ofsll-Params>
               <Custmis>
                  <CUST>1111532</CUST>
                  <BRNCD>001</BRNCD>
                  <Customermis>
                     <MISCLS>AGRICLTRE</MISCLS>
                  </Customermis>
                  <Customermis>
                     <MISCLS>SERVICE</MISCLS>
                  </Customermis>
                  <Customermis>
                     <MISCLS>MANUF</MISCLS>
                  </Customermis>
               </Custmis>
               <Jointcustomer>
                  <CUSTNO>1111532</CUSTNO>
               </Jointcustomer>
               <Custaccdet>
                  <CUSTNO>1111532</CUSTNO>
                  <Relationship-Linkage>
                     <CUSTOMER>1111532</CUSTOMER>
                     <RELATIONSHIP>PRIMARY</RELATIONSHIP>
                     <INHERIT>N</INHERIT>
                     <DESCP>ABENEZER DESTA ZELEKE</DESCP>
                  </Relationship-Linkage>
               </Custaccdet>
               <Custacdetail>
                  <CUSTNO>1111532</CUSTNO>
               </Custacdetail>
               <UDFDETAILS>
                  <FLDNAM>FSF_AUDITED</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_FY</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_NET_WORTH_CODE</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_PBT_AMOUNT</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_PBT_CODE</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_TAX_LIAB</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_TOT_ASSETS</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_TOT_EXPENSE</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_TOT_INCOME</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>FSF_TOT_LIAB</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>TRADE_LICENSE_NO</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>MOTHER NAME</FLDNAM>
                  <FLDVAL>MESELECH BOGALE</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>AVERAGE MONTHLY INCOME</FLDNAM>
                  <FLDVAL>13,000</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>AVERAGE ANNUAL INCOME</FLDNAM>
                  <FLDVAL>-</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>TOWN</FLDNAM>
                  <FLDVAL>AA</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>SUBCITY</FLDNAM>
                  <FLDVAL>NEFAS SILK LAFTO</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>KEBELE</FLDNAM>
                  <FLDVAL>-</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>WOREDA</FLDNAM>
                  <FLDVAL>02</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>HOUSE NO</FLDNAM>
                  <FLDVAL>013/38</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>P.O.BOX</FLDNAM>
                  <FLDVAL>-</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>ID TYPE</FLDNAM>
                  <FLDVAL>KEBELE</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>ID NO</FLDNAM>
                  <FLDVAL>LAFTO/2.14/BT4B13/38/3</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>NAME OF ISSUING AUTHORITY-ID</FLDNAM>
                  <FLDVAL>KEBELE /WEREDA 02LAFTOK/K</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>DATE OF ID ISSUED</FLDNAM>
                  <FLDVAL>2020-09-21</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>GUARDIANSHIP ISSUING AUTHORITY</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>GUARDIANSHIP NO</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>EMPLOYER</FLDNAM>
                  <FLDVAL>ENAT BANK</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>OCCUPATION</FLDNAM>
                  <FLDVAL>-</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>POSITION</FLDNAM>
                  <FLDVAL>-</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>ET_NATIONAL_ID</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>IS PEP</FLDNAM>
                  <FLDVAL>Y</FLDVAL>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>SALES AMOUNT</FLDNAM>
               </UDFDETAILS>
               <Extsys-Ws-Master/>
               <Master>
                  <KEY_ID>1111532</KEY_ID>
                  <FUNCTION_ID>STDCIF</FUNCTION_ID>
               </Master>
            </Customer-Full>
            <FCUBS_WARNING_RESP>
               <WARNING>
                  <WCODE>ST-SAVE-023</WCODE>
                  <WDESC>Record Successfully Retrieved</WDESC>
               </WARNING>
            </FCUBS_WARNING_RESP>
         </FCUBS_BODY>
      </QUERYCUSTOMER_IOFS_RES>
   </S:Body>
</S:Envelope>